In [1]:
2+2

4

In [11]:
a = { 
    'customers': ['A', 'B' , 'C' ,'D' ],
    'sales': [1100,959.50,'$800.00','$1100.50']
    }

In [12]:
import pandas as pd
df = pd.DataFrame(a)

In [13]:
df

  customers     sales
0         A      1100
1         B     959.5
2         C   $800.00
3         D  $1100.50

In [15]:
df['sales'] = df.sales.replace('[$,]','',regex=True).astype('float')

In [16]:
df

  customers   sales
0         A  1100.0
1         B   959.5
2         C   800.0
3         D  1100.5

In [17]:
df.sales.apply(type)

0    <class 'float'>
1    <class 'float'>
2    <class 'float'>
3    <class 'float'>
Name: sales, dtype: object